[{"community": "GUILTY GEAR","title": "Happy Chaos might possibly be low tier", "content": "Before I get flamed in the comments, just know that so far, I've had a great time so far playing HC. But, from my experience at least, I feel his drawbacks far outweigh the benefits. His normals are just too awful. Slow startup, slow recovery, little combo potential. This is obviously by design as you're supposed to compensate for these weaknesses thanks to the gun mechanic and on paper that makes sense, but in practice, The absurd 2 resources run out too frequently to put up a good offensive. Even worse is his defense is terrible. Literally not a single invincible reversal, not even his attack super is invinvible, I've been jabbed out of it too often. I think if the right balance is hit, HC would be high, maybe even top, tier. But as it stands, he's bottom.", "user_id": 1}, 
{"community": "GUILTY GEAR","title": "Why is Happy Chaos so busted?", "content": "Seriously. It somehow feels like Happy always has ammo. The ease at which he can summon his BS clones and reload for free is absurd. As for concentration, I played against tens of Happy's yesterday and can count the number of times they ran out of concentration on one hand. That install concentration super is just too powerful, and the meterless concentration refill special is quick and powerful as well. I haven't struggled against a character like this since day 1 Sol. Daisuke seriously needs to chill out on the OP DLC characters, I get they cost extra money, but making them this powerful really disrupts the balance of the game.", "user_id": 2}, 
{"community": "GUILTY GEAR","title": "I've played so much Strive now, I imagine roman canelling everything IRL", "content": "I accidentally reached for the wrong cup, I imagine PRC'ing into grabbing the right one. A door is about to close in front of me and I picture DBRCing through the door real quick. Someone bumps into me on the sidewalk and I imagine YRC'ing to recover quicker. I don't know if that means that RC's are that intricate and deep that I can apply them to real life scenarios so easily, or that I'm slowly going insane watching my Zato die to Rams and Sols. Either way is fine with me lol.", "user_id": 1}, 
{"community": "GUILTY GEAR","title": "Who's more annoying, Ram or Sol?", "content": "Personally my money's on Ram. Used to be Sol, but since the last big patch, I've seen Ram in my nightmares more often than Sol.", "user_id": 1}, 
{"community": "STREET FIGHTER","title": "Anyone else not like Luke's default costume?", "content": "In general, I'm okay with the design. A lot of people have complaints about the bulky forearms, and I did too, until I saw his V-trigger with steam coming out of them and kinda liked them. But his default costume is so... bad? The hair is weird and the shorts plus short leggings thing looks weird as well. His story and track costume actually look pretty cool, doesn't fix the hair but no barber can, and the battle costume is okay. Am I alone in this?", "user_id": 1}, 
{"community": "STREET FIGHTER","title": "What's your SFVI wishlist?", "content": "Curious on what you guys want to see in SFVI(SF6?)? My big wish is a SF3S type new cast set in the future.", "user_id": 2}, 
{"community": "STREET FIGHTER","title": "Next big crossover type character like Akira?", "content": "I played a fair amount of Rival Schools when growing up so seeing Akira added to the cast was amazing. I was wondering if there are any smaller Capcom fighting game characters you want to see added to the game?", "user_id": 2}, 
{"community": "STREET FIGHTER","title": "The game is content complete and still no rollback", "content": "I didn't really expect it, but it still sucks. Especially when you've played Strive's rollback. It feels like playing offline. Then go back to SFV and it feels like my controllers are full of honey. The inputs take so long to show up, frames are dropped everywhere, it's a mess all around. If SF6 doesn't have rollback, I'm not getting it", "user_id": 1}, 
{"community": "MORTAL KOMBAT","title": "Now that MK11 offically has ended support, is it better than 10?", "content": "11 and 10 took wildly different approaches to the MK formula. Both have their pros and cons, but overall, I prefer the cast and mechnaics in 11, WBY?", "user_id": 1}, 
{"community": "MORTAL KOMBAT","title": "Fatalities are a relic of the past.", "content": "They were added to the original game to add incentive to put in more quarters since you were more likely to mess up the inputs than get them right. But in today's FG landscape, they're a relic. They don't add anything to the gameplay, they're not difficult to pull of, and the returns on them diminish almost instantly. Anyone who's played the game for a couple months probably doesn't use or really enjoy fatalities anymore. X-rays are the correct step forward, keeping the graphic violence fatalities are known for while making the use of them an actually interesting gameplay mechanic. I would happily give up fatalities, or reduce it to just 1 per character, if that means more X-rays per character with unique mechanics. Thanks for coming to my TED talk", "user_id": 2}, 
{"community": "MORTAL KOMBAT","title": "Fatalities are the symbol of MK", "content": "Just read a post about someone saying fatalities are a 'relic of the past' which is ridiculous. Fatalities are not only integral to the identity of MK as a whole, but to the history of video games as a whole. They basically instigated the creation of the ESRB singlehandidly. Imagine a GG game with no RCs, SF game with no shoryukens, Smash without Mario. The same principle applies to fatalities, it's part of the core identity of MK. You can't have one without the other IMO.", "user_id": 1}, 
{"community": "MORTAL KOMBAT","title": "I miss Erron.", "content": " After seeing the Happy Chaos trailer, I was immediately reminded of Erron from MKX, I miss that cowboy.", "user_id": 2}, 
{"community": "SMASH","title": "13.0.1 IS THE FINAL PATCH!", "content": "This is not a drill. After 13.0.1, SSBU will be complete. I swear if the mouse isn't nerfed, I will be very upset for a little.", "user_id": 2}, 
{"community": "SMASH","title": "Sora needs some buffs in 13.0.1", "content": "The idea behind his game plan is cool and all, but it doesn't work out too often in practice. Give him another aerial jump, because he's really lacking in vertical recovery.", "user_id": 2}, 
{"community": "SMASH","title": "Why is Smash on a website named Neutral?", "content": "Cool site and all, but why is Smash a choice for a webiste named Neutral? Smash has no neutral! :P", "user_id": 1}, 
{"community": "SMASH","title": "Sephiroth may have the best reveal trailer, but Joker wins best overall reveal", "content": "It was a serious 'you had to be there' moment watching TGA and all the power went off. Geoff seemed genuinely confused and we were all giggling thinking something went wrong in this live event, when suddenly the room turns red. The reveal trailer starts playing. But it's not obvious at first what it is. 'No way, P5 on Switch? P5 remake??' We sat there with baited breath waiting to see what it was. The letter forms, it turns around and we see the smash logo and everyone and their mother loses their damn minds. I fly backwards off my seat screaming in shock and joy, TGA crowd goes berserk. I don't think any other announcement will ever shock me as much as that did for the rest of my life. The fact it was the first one as well so we didn't immediately know when to expect DLC or about the invitation was genius. Can't wait to be let down in a couple of days this coming TGA", "user_id": 1}, 
{"community": "ALL","title": "DPs are not BS, you're just bad", "content": "The DP has been around in it's current form since SFII, and people have been able to adapt around it since then. If you're getting DPing on wakeup, the blame is on you, learn oki better.", "user_id": 1}, 
{"community": "ALL","title": "Rush downs are just too much fun", "content": "Every time I start a new fighting game, I always gravitate to rushdown. Leo/Gio is Strive, Rashid in SFV, Liu Kang in MK11. It's not on purpose or intentional, they're just too much fun. Anyone else feel like this?", "user_id": 1}, 
{"community": "ALL","title": "Favorite overall FG mechanic?", "content": "My money's on Roman Cancels from Guilty Gear. So simple, yet so versatile and deep.", "user_id": 2}, 
{"community": "ALL","title": "Do you purchase season passes, or just individual characters?", "content": "I'm usually a season pass guy myself, but I'm curious what the ratio is.", "user_id": 2}]




